Revit 2027 API
ViewDisplayDepthCueing.FadeTo Property
 The fade to defines the maximum fading in per cent. Values between 0 and 100.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int FadeTo { get; set; }
Public Property FadeTo As Integer
	Get
	Set
public:
property int FadeTo {
	int get ();
	void set (int value);
}
member FadeTo : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The fade to value is not valid. The valid range is 0 to 100.
See Also
Reference
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace